Masmiseim36/nxpSDK/boards/frdmimxrt1186/demo_apps/mc_pmsm/pmsm_servo_dual/cm7/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1186xxxxx
package_id: MIMXRT1186CVJ8C
mcu_data: ksdk2_0
processor_version: 25.09.0
pin_labels:
- {pin_num: B8, pin_signal: GPIO_AON_15, label: ETH0, identifier: ETH0;ETH0_RESET}
- {pin_num: A3, pin_signal: GPIO_AON_20, label: ETH2, identifier: ETH2;ETH2_RESET}
- {pin_num: F5, pin_signal: GPIO_EMC_B1_01, label: M1_ENDAT_DIR_ENC_B, identifier: pin;flexio_pin;ENC_B;M1_ENDAT_DIR_ENC_B}
- {pin_num: M14, pin_signal: GPIO_AD_29, label: M2_SINC_VOLT_DCB, identifier: FLEXIO_SPI;CUR_C;M2_SINC_VOLT_DCB}
- {pin_num: D8, pin_signal: GPIO_AON_03, label: ETH0, identifier: ETH0_INT_B}
- {pin_num: E7, pin_signal: GPIO_AON_04, label: ETH2, identifier: ETH2_INT_B}
- {pin_num: M13, pin_signal: GPIO_AD_12, label: M2_ENDAT_DATA_OUT_ENC_HOME, identifier: CUR_A;M2_ENDAT_DATA_OUT_ENC_HOME}
- {pin_num: M12, pin_signal: GPIO_AD_13, label: M2_ENDAT_CLK_ENC_I, identifier: CUR_B;M2_ENDAT_CLK_ENC_I}
- {pin_num: M11, pin_signal: GPIO_AD_14, label: M2_ENDAT_DIR_ENC_B, identifier: VOLT_DCB;M2_ENDAT_DIR_ENC_B}
- {pin_num: E5, pin_signal: GPIO_EMC_B1_12, label: M1_PWM_AT, identifier: PWM_AT;M1_PWM_AT}
- {pin_num: E3, pin_signal: GPIO_EMC_B1_13, label: M1_PWM_AB, identifier: PWM_AB;M1_PWM_AB}
- {pin_num: F4, pin_signal: GPIO_EMC_B1_14, label: M1_PWM_BT, identifier: PWM_BT;M1_PWM_BT}
- {pin_num: D1, pin_signal: GPIO_EMC_B1_15, label: M1_PWM_BB, identifier: PWM_BB;M1_PWM_BB}
- {pin_num: B1, pin_signal: GPIO_EMC_B1_17, label: M1_PWM_CT, identifier: PWM_CT;M1_PWM_CT}
- {pin_num: E2, pin_signal: GPIO_EMC_B1_16, label: M1_PWM_CB, identifier: PWM_CB;M1_PWM_CB}
- {pin_num: D3, pin_signal: GPIO_EMC_B1_11, label: LED_GREEN_CTL, identifier: LED_GREEN_CTL}
- {pin_num: G3, pin_signal: GPIO_EMC_B1_00, label: M1_ENDATA_DATA_IN_ENC_A, identifier: ENC_A;ENCODER_00;M1_ENDATA_DATA_IN_ENC_A}
- {pin_num: E10, pin_signal: GPIO_SD_B1_03, label: M1_OC_FAULT, identifier: OV_FAULT;OC_FAULT;M1_OC_FAULT}
- {pin_num: K1, pin_signal: GPIO_EMC_B1_39, label: M1_OV_FAULT, identifier: OC_FAULT;OV_FAULT;M1_OV_FAULT}
- {pin_num: B2, pin_signal: GPIO_EMC_B1_18, label: M2_PWM_AT, identifier: J53_14;J53_12;M2_PWM_AT}
- {pin_num: E4, pin_signal: GPIO_EMC_B1_19, label: M2_PWM_AB, identifier: J53_14;M2_PWM_AB}
- {pin_num: E6, pin_signal: GPIO_EMC_B1_03, label: M1_ENDAT_DATA_OUT_ENC_HOME, identifier: M1_ENDAT_DATA_OUT_ENC_HOME}
- {pin_num: G2, pin_signal: GPIO_EMC_B1_02, label: M1_ENDAT_CLK_ENC_I, identifier: M1_ENDAT_CLK_ENC_I}
- {pin_num: J6, pin_signal: GPIO_EMC_B1_25, label: M2_ENDAT_DATA_OUT_ENC_HOME_FlexIO1, identifier: M2_ENDAT_DATA_OUT_ENC_HOME;M2_ENDAT_DATA_OUT_ENC_HOME_FlexIO1}
- {pin_num: J3, pin_signal: GPIO_EMC_B1_24, label: M2_ENDAT_CLK_ENC_I_FlexIO1, identifier: M2_ENDAT_CLK_ENC_I;M2_ENDAT_CLK_ENC_I_FlexIO1}
- {pin_num: E1, pin_signal: GPIO_EMC_B1_05, label: M2_OC_FAULT, identifier: M2_ENDAT_DIR_ENC_B;M2_ENDAT_DIR_ENC_B_FlexIO1;M2_OC_FAULT}
- {pin_num: H5, pin_signal: GPIO_EMC_B1_04, label: M2_OV_FAULT, identifier: M2_ENDATA_DATA_IN_ENC_A;M2_ENDATA_DATA_IN_ENC_A_FlexIO1;M1_VOLT_DCB;M1_SINC_VOLT_DCB;M2_OV_FAULT}
- {pin_num: D2, pin_signal: GPIO_EMC_B1_20, label: M2_PWM_BT, identifier: M2_PWM_BT}
- {pin_num: H6, pin_signal: GPIO_EMC_B1_21, label: M2_PWM_BB, identifier: FlexPWM2_PWM1_BB;M2_PWM_BB}
- {pin_num: C1, pin_signal: GPIO_EMC_B1_23, label: M2_PWM_CT, identifier: M2_PWM_CT}
- {pin_num: J4, pin_signal: GPIO_EMC_B1_22, label: M2_PWM_CB, identifier: M2_PWM_CB}
- {pin_num: K13, pin_signal: GPIO_AD_19, label: M2_OV_FAULT, identifier: M2_OV_FAULT}
- {pin_num: F3, pin_signal: GPIO_EMC_B1_08, label: M1_SINC_CUR_B, identifier: M1_SINC_CUR_B}
- {pin_num: C2, pin_signal: GPIO_EMC_B1_10, label: M1_SINC_CUR_A, identifier: M1_SINC_CUR_A}
- {pin_num: C11, pin_signal: GPIO_B2_05, label: M1_SINC_CLK1, identifier: M1_SINC_CLK1}
- {pin_num: C14, pin_signal: GPIO_B2_11, label: M2_SINC_CUR_A, identifier: M2_SINC_CUR_A}
- {pin_num: D10, pin_signal: GPIO_B2_09, label: M2_SINC_CUR_B, identifier: M2_SINC_CUR_B}
- {pin_num: E9, pin_signal: GPIO_B2_04, label: M2_SINC_CLK0, identifier: M2_SINC_CLK0}
- {pin_num: L11, pin_signal: GPIO_AD_15, label: M2_ENDATA_DATA_IN_ENC_A, identifier: M2_ENDATA_DATA_IN_ENC_A}
- {pin_num: H4, pin_signal: GPIO_EMC_B1_06, label: M1_SINC_VOLT_DCB, identifier: M1_SINC_VOLT_DCB}
- {pin_num: B5, pin_signal: GPIO_AON_18, label: TP_J3_16, identifier: TP_;TP_J3_16}
- {pin_num: A4, pin_signal: GPIO_AON_19, label: TP_J3_18, identifier: TP_J3_18}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbar.h"
#include "fsl_iomuxc.h"
#include "fsl_rgpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitPWM();
    BOARD_InitLPUART();
    BOARD_InitENC();
    BOARD_InitSINC();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: D3, peripheral: RGPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_EMC_B1_11, direction: OUTPUT}
  - {pin_num: B5, peripheral: RGPIO1, signal: 'gpio_io, 18', pin_signal: GPIO_AON_18, identifier: TP_J3_16, direction: OUTPUT}
  - {pin_num: A4, peripheral: RGPIO1, signal: 'gpio_io, 19', pin_signal: GPIO_AON_19, direction: OUTPUT, pull_up_down_config: Pull_Down}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

