Masmiseim36/nxpSDK/boards/frdmimxrt1186/demo_apps/mc_pmsm/pmsm_servo_dual/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSINC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: C2, peripheral: SINC3, signal: 'EMBIT, 3', pin_signal: GPIO_EMC_B1_10}
  - {pin_num: F3, peripheral: SINC3, signal: 'EMBIT, 2', pin_signal: GPIO_EMC_B1_08}
  - {pin_num: H4, peripheral: SINC3, signal: 'EMBIT, 1', pin_signal: GPIO_EMC_B1_06}
  - {pin_num: C11, peripheral: SINC3, signal: 'MOD_CLK, 1', pin_signal: GPIO_B2_05}
  - {peripheral: SINC3, signal: 'EXT_TRIG, 0', pin_signal: FLEXPWM4_PWM0_OUT_TRIG0_1}
  - {pin_num: C14, peripheral: SINC2, signal: 'EMBIT, 3', pin_signal: GPIO_B2_11}
  - {pin_num: D10, peripheral: SINC2, signal: 'EMBIT, 2', pin_signal: GPIO_B2_09, pull_down_pull_up_config: Pull_Down}
  - {pin_num: M14, peripheral: SINC2, signal: 'EMBIT, 1', pin_signal: GPIO_AD_29, identifier: M2_SINC_VOLT_DCB, pull_up_down_config: Pull_Down}
  - {pin_num: E9, peripheral: SINC2, signal: 'MOD_CLK, 0', pin_signal: GPIO_B2_04}
  - {peripheral: SINC2, signal: 'EXT_TRIG, 1', pin_signal: FLEXPWM2_PWM0_OUT_TRIG0_1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSINC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSINC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_29_SINC2_EMBIT01,        /* GPIO_AD_29 is configured as SINC2_EMBIT01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_04_SINC2_MOD_CLK0,       /* GPIO_B2_04 is configured as SINC2_MOD_CLK0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_05_SINC3_MOD_CLK1,       /* GPIO_B2_05 is configured as SINC3_MOD_CLK1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_09_SINC2_EMBIT02,        /* GPIO_B2_09 is configured as SINC2_EMBIT02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_11_SINC2_EMBIT03,        /* GPIO_B2_11 is configured as SINC2_EMBIT03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_06_SINC3_EMBIT01,    /* GPIO_EMC_B1_06 is configured as SINC3_EMBIT01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_08_SINC3_EMBIT02,    /* GPIO_EMC_B1_08 is configured as SINC3_EMBIT02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_10_SINC3_EMBIT03,    /* GPIO_EMC_B1_10 is configured as SINC3_EMBIT03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm0OutTrig01, kXBAR1_OutputSinc123ExtTrig0); /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN90 input is connected to XBAR1_OUT148 output assigned to SINC1_2_3_EXT_TRIG0 */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm2Pwm0OutTrig01, kXBAR1_OutputSinc123ExtTrig1); /* FLEXPWM2_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN82 input is connected to XBAR1_OUT149 output assigned to SINC1_2_3_EXT_TRIG1 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_29_SINC2_EMBIT01,        /* GPIO_AD_29 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_09_SINC2_EMBIT02,        /* GPIO_B2_09 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENC_copy_1:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: G3, peripheral: FLEXIO1, signal: 'IO, 00', pin_signal: GPIO_EMC_B1_00, identifier: M1_ENDATA_DATA_IN_ENC_A}
  - {pin_num: F5, peripheral: FLEXIO1, signal: 'IO, 01', pin_signal: GPIO_EMC_B1_01, identifier: M1_ENDAT_DIR_ENC_B}
  - {pin_num: E6, peripheral: FLEXIO1, signal: 'IO, 03', pin_signal: GPIO_EMC_B1_03}
  - {pin_num: G2, peripheral: FLEXIO1, signal: 'IO, 02', pin_signal: GPIO_EMC_B1_02}
  - {peripheral: FLEXIO1, signal: 'TRIG_IN, 0', pin_signal: FLEXPWM4_PWM2_OUT_TRIG0_1}
  - {pin_num: L11, peripheral: FLEXIO2, signal: 'IO, 15', pin_signal: GPIO_AD_15}
  - {pin_num: M11, peripheral: FLEXIO2, signal: 'IO, 14', pin_signal: GPIO_AD_14, identifier: M2_ENDAT_DIR_ENC_B}
  - {pin_num: M13, peripheral: FLEXIO2, signal: 'IO, 12', pin_signal: GPIO_AD_12, identifier: M2_ENDAT_DATA_OUT_ENC_HOME}
  - {pin_num: M12, peripheral: FLEXIO2, signal: 'IO, 13', pin_signal: GPIO_AD_13, identifier: M2_ENDAT_CLK_ENC_I}
  - {peripheral: FLEXIO2, signal: 'TRIG_IN, 0', pin_signal: FLEXPWM2_PWM1_OUT_TRIG0_1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

